[
    {
    "id":0,
        "cover":"https://user-images.githubusercontent.com/106279616/219403814-8c0b191d-b018-453e-ae8b-bf70a7adfaa9.png",
        "title":"Facebook clone",
        "tools":["Django","Python","Html","CSS","Bootstrap","Jquery","Beautifulsoup"],
        "loginMust": "O (회원가입 시)",
        "idea_clone":["10% (크롤링하여서 뉴스를 구성한 부분)", "90% (인스타그램 클론 튜토리얼 코드를 재사용하여 페이스북 페이지를 보며 따라함)"],
        "ratio":[10,90],
        "function":["네비바", "피드", "피드 업로드 (텍스트만, 사진만, 텍스트와 사진 같이)","피드 좋아요(좋아요 아이콘, 좋아요 개수)","댓글","댓글의 좋아요","댓글의 댓글","피드 수정","피드 삭제(데이터 삭제)","피드 숨기기(데이터 존재)","피드 공유","뉴스 (beautifulsoup (실시간 뉴스))","뉴스 검색","로그인, 로그아웃, 가입"],
        "nameWhy": null,
        "hardPart":[
            "좋아요 기능을 구현하면서 '모델' 파일을 여러 번 수정하곤 했는데, 많은 'MVC''개발자들이 잘 알듯 모델 파일은 데이터베이스에 관한 것이기 때문에 매우 민감합니다, 어느날 데이터를 삭제하고 강제로 마이그레이션하는 도중 'no this table' 오류로 인해 마이그레이션이 전혀 작동하지 않았습니다. 이로인해 많은 시간을 낭비하게 되었고 그러던중 마이그레이션 파일 없이도 데이터베이스의 스키마를 동기화할 수 있게하는 'py manage.py migrate --run-syncdb'라는 해결책을 얻었게 되었습니다. 이 오류가 장고 개발자들에게 해결하기 어려운 오류일지는 모르겠지만, 그때는 제가 다른 사람의 도움 없이 만든 첫 번째 프로젝트로였기 때문에 힘들었던 기억이 있습니다.",
            "기본적으로 Django와 Jquery는 SPA를 위한 것이 아니기 때문에, 다른 페이지로 이동하지 않고 실시간으로 변경되는 '좋아요 개수'를 구현하기 것은 초보자였던 그때의 나로써는 정말 어려웠습니다. 그래서 저는 실시간으로 입력되고 데이터베이스에 저장된 좋아요 번호를 반복적으로 비교하여 모든 시행착오를 거쳐 오류를 해결할 수 있었습니다.",
            "Auth 파트를 구현하고 유저 정보를 DB에 저장하는 동안 해시화된 비밀번호와 입력된 비밀번호가 일치하지 않다고 나와 로그인에 계속 실패하였습니다, 그러던중 클라이언트에서 서버로 데이터를 암호화하여 전송할 때, formdata-method를 사용하면 암호화를 인식하지 않는 완전히 다른 암호로 바뀐다는 것을 발견했습니다. 그래서 저는 Json-method를 사용했고, Ajax를 사용하는 대신 그냥 폼 태그를 사용하여 데이터를 서버로 전송하여 오류를 해결했습니다. 이 해결책을 찾는 데 거의 이틀이나 걸렸네요.."],
        "thingsToFix": "클린코드로 바꾸기, 알아보기 쉬운 영어주석, Ajax부분에 success, error, complete 안에있는 'console log'를 없애고 대체하기",
        "description":"처음 만든 프로젝트이기 때문에 부족한 부분이 많이 있겠지만, 이번 프로젝트를 계기로 웹 개발함에 있어 실력이 향상 되었음을 많이 느꼈습니다. 시간이 지나 이 프로젝트에서 나의 부족함을 발견하였지만, 나의 실행착오 과정을 남기고 싶어서 싶어서 처음 완성한 이후에 코드를 많이 수정하지 않았습니다, 그래서 코드에 부족한 부분이 있더라도 봐주세요.",
        "url":null,
        "githubUrl":"https://github.com/johnpark144/Facebook_clone_project--Django"
    },
    {
        "id":1,
        "cover":"https://user-images.githubusercontent.com/106279616/219403876-61877351-916f-44b1-84fd-b2c8a5ed78ee.png",
        "title":"MYabc",
        "tools":["React","JavaScript","CSS","Tailwind","FireBase","RTL","Jest","Cypress","Dictionary API","Youglish API","Grammarly API","PhotoShop"],
        "loginMust": "O (회원가입 or Oauth)",
        "idea_clone":["85%", "15% (Vocabulary 부분 조금 참고)"],
        "ratio":[85,15],
        "function":["반응형 웹 사이트","테스트 코드 (Jest, Cypress, RTL)","로그인, 로그아웃, 회원 가입","구글, 깃허브, 페이스북 아이디로 로그인 (Oauth)","네비게이션 바와 모달(작은 네비바)","Notfound(404) 에러 사이트","Home 페이지 부분에 애니메이션 및 스타일 변화, 디자인","로딩중 플레이스 홀더 (데이타 존재 여부 상관없이)","Days 추가 및 제거 (하루에 외울 단어를 넣기 위해)","Words 추가 및 제거","단어 가리기 및 보이기 (단어 외우기 위해)","표안에 회색 줄 (외운 단어들 표시)","day마다 넘어가기","영영사전 (Dictionary API)","스터디를 위한 유튜브 비디오 (단어사용 빈도수와 문맥을 확인하기 위해) (Youglish API)","동영상 보면서 단어 저장","문법체크 (Grammarly API)"],
        "nameWhy": "'ABC'는 알파벳의 시작이지만 때론 영어 공부의 시작을 의미하기 때문에 저는 그것을 MYabc라고 이름 지었습니다.",
        "hardPart":[
            "영어 동영상 API 호출 제한 때문에, 저는 하루 호출량이 초과하면 동영상 섹션 부분을 테스트를 할 수 없었습니다. 그래서 저는 효율적으로 검증하는 방법을 배우게 되었습니다",
            "삭제 할지말지 결정하는 모달부분을 구현하면서, 어떠한 데이터든 '삭제'를 누를 때마다, 안타깝게도 마지막 데이터만 삭제가 되었습니다. 그러나 해결책은 모달을 만드는 컴포넌트를 기존 배열을 펼쳐서 새로운 배열을 만드는 고차함수 map안에 두는것 이였습니다. 그 이유를 알고보니 map 바깥에 존재하면 마지막 데이터만 적용되기 때문이었습니다. 이제는 모달을 띄우기 위해 클릭하면 삭제할 데이터의 모달이 나옵니다.",
            "저는 다른 디파지토리에 존재하는 포트폴리오 웹사이트를 만든 후 리액트 테스팅 라이브러리와 Jest를 배우게 되었습니다. 그리고 이 프로젝트에 테스트 코드를 적용시키도록 하였습니다. 하지만 React-router-dom과 파이어베이스에 대한 테스트 코드를 배치하는 데 어려움을 겪었습니다. 그래서 그냥 E2E 테스트를 위해 사이프레스를 추가하였고 다행히도 중요한 기능에 대한 모든 테스트 코드는 테스트를 통과하게 되었습니다. 이러한 경험을 통해 Jest, RTL, Cypress에 대해 더 공부하고 익혀야 되겠다고 생각했습니다."],
        "thingsToFix": "클린코드로 바꾸기, 알아보기 쉬운 영어주석, 영어 공부를 위한 더나는 방법들을 구현해보기, 파이어베이스와 React-router-dom을 어떻게 테스트 할것인지 더 공부 할 필요가 있다",
        "description":"이것은 영어공부를 필요로 하는 저를 포함한 모든 사람들을 위해 유용하게 사용하기 위해 만든 MYABC라는 이름의 영어 학습 사이트입니다. 제가 처음 미국에 왔을 때, 언어 장벽 때문에 모든 것이 어렵게만 느껴졌습니다. 그리고 많은 시행착오를 겪으면서 영어실력이 향상 되었던 것을 기억합니다. 이는 자주 사용하는 단어와 문장의 맥락을 공부하는 것이였습니다. 그리고 또한 영어로 영어의 단어의 의미를 확인하는 것은 단어의 진정한 의미를 알기 위해 도움이 많이 되었고, 그래서 제가 실제로 영영 사전과 영어 동영상을 주로 사용했습니다. 저는 그 경험을 바탕으로 영어 공부를 위한 웹사이트나, 애플리케이션을 개발하는 것이 좋을 것 같다고 생각하게 되었고 실천에 옮기게 되었습니다. 나중에 리액트 네이티브를 배울 기회가 있다면 앱으로도 만들 생각입니다.",
        "url":"https://resilient-hummingbird-f7421f.netlify.app/",
        "githubUrl":"https://github.com/johnpark144/MYabc_project--React_FireBase"
    },
    {
        "id":2,
        "cover":"https://user-images.githubusercontent.com/106279616/219403907-3a676f69-acba-41d0-97cc-40da712e5f29.png",
        "title":"Stillsteal (Ecommerce)",
        "tools":["React","Django","JavaScript","Python","CSS","Tailwind","MySql","ContextApi","PhotoShop"],
        "loginMust": "X (그러나 회원가입, 로그인 기능은 있음)",
        "idea_clone":["75%", "25% (어떻게 인터넷 쇼핑사이트가 구성되있는지 여러 사이트 참고)"],
        "ratio":[75,25],
        "function":["반응형 웹 사이트","로그인, 로그아웃, 회원 가입 (로그인없이 장바구니 사용가능)","JWT를 사용하여 토큰을 갱신","네비게이션 바, 네비게이션 사이드 바","카트에 추가, 제거","검색","과거 검색기록(로컬 스토리지)과 삭제","상품 디테일, 체크아웃 메뉴, 카트 메뉴 안 에서 카트보기","페이지네이션","페이지 당 표시 할 포스트 수","아래 1, 2, 3 목록들에 따라 동시에 정렬 되도록","1 카테고리 별 정렬","2 가격 낮은 순, 가격 높은 순, 이름 오름차 순, 이름 내림차 순, 평점 별로 정렬","3 특정 가격 이하만 정렬","상품 디테일","체크아웃 (페이기능은 아직 없음)","이미지 애니메이션 및 디자인 (Home-product, AboutUs, sidebar 안에)","데이터 발견 할때까지 로딩 스피너 (데이터 없어도)"],
        "nameWhy": "제가 이 사이트를 'stillsteal'이라고 이름을 지은 이유는, '여전히' 라는 의미의 'still'과, 우리가 가성비 좋은 제품들을 볼 때마다, 영어로 'that's steal!' 이라고 말하곤 하는데 그것의 'steal'을 합쳐서 항상 싸다는 것을 강조하기위해 'stillsteal'이라 이름을 짓게 되었습니다.",
        "hardPart":[
            "카트 기능을 구현하는 동안, '로컬 스토리지'가 필요하다는 것을 깨달았았고, 처음 써보는 거라 그때는 좀 힘들었습니다. 특히 페이지 새로 고침 할 때마다, 스토리지 데이터들이 삭제되었습니다, 오류를 확인해보니 '[]'안에 오타가 있었기 때문입니다, 그러나 현재는 로컬스토리지를 사용하는데 더욱 익숙해 질 수 있었습니다.",
            "웹 사이트의 핵심 기능보다 있는지도 티 안나는 미묘한 기능에 더 많은 코드가 요구될때, 여러 번 구현을 해야 할지 말지 고민 하였습니다. 하지만 저는 예를 들면 <디테일 페이지로 이동했다가 다시 카테고리 페이지로 돌아가면, 전에 지정해둔 '정렬 기준', '페이지당 표시할 게시물 수', '페이네이션' 등 모든 상태를 기억하며 다시 되돌아가는것> 과 같은 작업들을 결국 구현 하였습니다. 그래서 그런지 솔직히 코드는 많이 복잡해졌지만, 이로인해 흔한 투두리스트 같은 사이트가 아니라 좋은 퀄리티의 사이트를 만들기를 원했습니다."],
        "thingsToFix": "클린코드로 바꾸기, 알아보기 쉬운 영어주석, 카드를 사용한 실시간 페이기능, JWT-token (JWT-token에 대해 더 공부할 필요가 있음)",
        "description":"이것은 제가 연습을 위해 만든 인터넷 쇼핑 웹 사이트입니다, 따지고보면 클론은 아니지만, 무엇을 구현하면 좋을지 참고하기 위해 몇몇 사이트를 참고하긴 했습니다.",
        "url":"https://tangerine-cactus-bf8a95.netlify.app",
        "githubUrl":"https://github.com/johnpark144/Stillsteal_Ecommerce_project--React_Django"
    },
    {
        "id":3,
        "cover":"https://user-images.githubusercontent.com/106279616/219403928-c3f245cd-1d76-4c53-8eef-b5e71657d024.png",
        "title":"MyTube",
        "tools":["Next JS","TypeScript","CSS","Tailwind","Reactquery","Redux(toolkit)","React-beautiful-dnd","React-timeago","Next-themes","YouTube Data API","YouTube rapidApi"],
        "loginMust": "X",
        "idea_clone":["45%","55% (튜토리얼 코드를 따라친것이 아닌, UI, UX를 많이 참고함)"],
        "ratio":[45,55],
        "function":["반응형 웹 사이트","네비게이션 바(헤더부분), 네비게이션 푸터(모바일용)","홈 애니메이션(설명)","검색과 장르별 비디오","마우스가 썸네일에 2초동안 올려져 있을때 비디오 미리보기","History (보기, 삭제, 모두삭제)","Watch later (보기, 삭제)","드래그 앤 드롭을 이용하여 Watch later에 비디오 저장 및 삭제","비디오 디테일 페이지에서 저장 및 알림","비디오 디테일","관련있는 비디오(API에서 추천), 다른 비디오(비디오 클릭전에 데이터들)","채널 디테일","날짜(시간)을 Timgago형식으로","다크모드","스피너 로딩중, Animate-pulse 로딩"],
        "nameWhy": "이름을 'MyTube'라고 지은 이유는 처음에 이 사이트는 'Watch later'에 유튜브의 영상을 저장하는 데에 초점을 맞췄고, 그것들을 저장함으로써 '나의 영상'이 되는것을 강조하려고 그랬습니다. 그뿐 아니라 이 웹사이트를 만들면서 로고에 대한 좋은 아이디어가 생각나서 그렇게 지었습니다.",
        "hardPart":[
            "저는 처음으로 Next js를 이용하여 웹사이트를 만들려 하였고 Vercel이 터보팩을 엄청 홍보하고 있다는 것을 보았습니다. 그래서 사용해 보았지만 너무나 많은 오류에 에러를 발견하였습니다. 그런데 오류를 고치기위한 터보팩에 대한 정보가 아직 충분하지 않았고, 이것저것 보며 해메다가 결국 터보팩을 사용하지 않고 웹팩을 사용하기로 결론을 내렸습니다.",
            "리액트 훅이나, Link 컴포넌트를 사용할 때 마다, 'call is undefined' 이라는 에러가 계속해서 발생하였습니다. 이틀 정도 고치려고 노력해봐도 어떠한 정보도 나오지 않았습니다. 겨우겨우 알아낸게 알고보니 그때 당시 Next JS 13의 최신버전에 문제가 있었고 그래서 오류가 고쳐질때까지 이전버전을 사용하는 것이 유일한 해결책이었습니다. (현재 버전은 괜찮네요, 다행히도 고쳐진것 같아요)",
            "이 웹 사이트를 Vercel로 처음에 배포할 때, 계속 실패하였고, 그래서 그것을 고치려고 구글에 열심히 검색해 보았지만, 해결책을 찾기엔 애매한 답들만 있었습니다. 하지만 그 후 한 폴더 이름의 첫 글자가 소문자로 되어있어야 하지만 대문자로 적힌 것을 발견 했습니다. 희안하게도 로컬 환경에서는 작동하는데 전혀 문제가 되지 않았는데, 배포시에만 문제가 되었습니다. 그래서 그런지 오류를 발견하기가 어려웠던것 같습니다.",
            "시간이 지나며 잦은 API 호출과 그에 대해 결제를 하지 않았다는 이유로 Vercel에서 제 사이트를 차단하였습니다, 해결책을 찾다가 'Cloudtype'이라는 좋은 플랫폼을 찾았고 그래서 그것을 사용하기로 했습니다."],
        "thingsToFix": "클린코드로 바꾸기, 'Home' 페이지 부분 UI 개선 (유용한 애니메이션 및 CSS 라이브러리를 배우기 이전이었음)",
        "description":"저는 Next JS, Redux, Reactquery, Darkmode, TypeScript 등과 같은 웹 사이트를 개발하는 데 유용한 기술들을 배우게 되었고, 그래서 이 웹 사이트를 만들면서 앞서 배운 모든 것들을 연습하고 싶었습니다. 제가 기술에 집중하여 구현했기 때문에, 기존 유튜브 사이트와는 매우 다를 것이고, 그래서인지 이름도 MyTube라고도 단순히 짓게 되었습니다, 그리고 사실 이 사이트를 만들면서 느낀게, 이런 종류의 사이트는 사실 SSR를 쓰지않고 일반 리액트로도 충분하다는 걸 느꼈습니다. 그래도 이 웹사이트를 만든 것은 단순히 배운 스킬들을 써먹었을 뿐만 아니라 SSR와 CSR 그리고 심지어 SSG의 차이를 배울 수 있어서 유익한 시간이 되었다고 생각합니다",
        "url":"https://port-0-mytube-1jx7m2gldonqeix.gksl1.cloudtype.app/",
        "githubUrl":"https://github.com/johnpark144/MyTube_project--Nextjs_TypeScript"
    },
    {
        "id":4,
        "cover":"https://user-images.githubusercontent.com/106279616/219403956-8a433da3-fbe0-4b95-b53a-0655dbf77261.png",
        "title":"DoorToDoor",
        "tools":["Next JS","TypeScript","CSS","Tailwind","Redux(toolkit)","FireBase","React-leaflet","Nominatim API","TileLayer","React-date-range","React-timeago","PhotoShop"],
        "loginMust": "O (개인 사용위해 OAuth는 부적합하다 판단하여, 오직 회원가입 한 사람만)",
        "idea_clone":["95%","5% (Nominatim API를 쓰는 방법에 대해서만)"],
        "ratio":[95,5],
        "function":["반응형 웹 사이트","인증부분 (회원가입, 로그인, 로그아웃)","스피너 로딩중","네비게이션바(헤더)","지도 (leaflet, OpenStreetMap)","주소 검색과 지도에 핀 위치시키기","지도 변경 (기본, 인공위성)","수정 모드","날짜 선택 및 입력 (디폴트 : today)","마커 색 변경 (파란 마커 or 초록 마커)","지도에 마커를 놓고 저장하기","취소","되돌리기","마커에 뜨는 팝업 (날짜, Timeago, 지정한 자의 이름, 입력한 정보)","수정모드의 팝업 (디테일 정보 수정, 마커 삭제 -> 내가 입력한 경우에만)","마커 선명도 : 6개월 초과 -> 0.6 / 1년 초과 -> 0.3 / 2년 초과 -> 삭제"],
        "nameWhy": "'door to door'의 의미는 '집집마다 돌아다니다' 라는 의미를 내포하고 있습니다. 그래서 이 웹사이트의 목적에 맞게 이름을 지었고, 또 그 이름에 맞는 좋은 로고 아이디어가 떠올랐습니다.",
        "hardPart":[
            "지도 라이브러리와 지리에 대한 API를 사용하는 것은 처음이었고, 파이어베이스 DB에 어떻게 위도와 경도 정보를 저장할지 고민했었습니다. 그 후 위도와 경도에 대해 별도의 데이터 저장 형식이 있다는 것을 하루종일 시간낭비 하고 나서야 알게되었습니다.",
            "위치를 클릭할때 마다 데이터를 매번 저장하는 것은 너무 빈번하고 비효율적이라는 것을 알게 되었고 그래서 배열형식으로 저장하기로 했습니다. 하지만 그런 방식에선 그 위치에 대한 상세한 데이터를 입력하고 업데이트하고 삭제하는 것은 어려웠습니다. 그래서 생각해낸 해결책은 경도와 위도의 데이터를 가진 모든 배열을 가져와 하나로 합쳐서 고차함수 map을 사용하여 배열을 한번에 펼치므로써, 해당 유저만 상세한 데이터를 입력하고 업데이트하고 삭제할수 있도록 하게 하였습니다."],
        "thingsToFix": "클린코드로 바꾸기, 알아보기 쉬운 영어주석, 전체 비밀번호를 개인사용을 위해 바꾸기 (현재 : 1948)",
        "description":"미국에서 나와 내 지인들은 집집마다 돌아다니며 설문조사를 하는일을 한적 있었습니다, 그러던 중에 어느날 나는 지인들이 최근에 이미 방문한 집에 나도모르게 다시 갔었고, 이게 너무 자주 발생해서 시간낭비라 생각이 되었습니다. 게다가 이웃들의 관점에서도 짜증나겠다 싶었습니다. 그래서 저는 먼저 지도와 달력을 다루는 API를 배웠고, 이 둘의 불편함을 해소하기위해 내 경험과 아이디어를 기반으로 이 사이트를 짓게 되었습니다. 다른 사람이 방문한 곳을 확인 할 수 있고, 나도 그것을 마킹하고 코멘트를 남길 수 있습니다. 마커는 시간이 지나며 흐려질 것이고, 2년이 지나면 사라질 것입니다.",
        "url":"https://port-0-doortodoor-1jx7m2gldonqeix.gksl1.cloudtype.app/",
        "githubUrl":"https://github.com/johnpark144/DoorToDoor_project--Nextjs_FireBase_TS"
    },{
        "id":5,
        "cover":"https://user-images.githubusercontent.com/106279616/222976680-c2526718-53ef-473d-91e0-9bb7c46f5961.png",
        "title":"Yeonghwan's Portfolio",
        "tools":["React","JavaScript","CSS","Styled-components","Vite","Framer-motion","Gsap","react-three","React-lottie-player","Scroll-out","react-chartjs-2","emailjs","PhotoShop","Pigma"],
        "loginMust": "X",
        "idea_clone":["90%","10%"],
        "ratio":[90,10],
        "function":null,
        "nameWhy": null,
        "hardPart":["전반적으로 가장 힘들었던 부분은 GSAP을 사용하여 반응형에 맞게 스크롤 이벤트를 구현하는 것 이었습니다, window 사이즈가 조정될 때 마다, 스크롤 값들도 또한 변경 되었습니다. 그래서 적당한 값들을 찾기위해 하나하나 일일히 계산해 봐야 했습니다.(ContactMe, MoonStarScroll, MyPath, Skills, Videos, Etc..) (시간을 잡아먹는 과정 1)",
            "당연히 몇몇 다른사람들의 포트폴리오들도 참고하였습니다만, 왠만하면 내 아이디어로 만들기를 원했습니다. 그래서 창작의 고통이 심했습니다.... (시간을 잡아먹는 과정 2)",
            "이메일 부분 스크롤 애니메이션을 구현하는 동안, 인풋 창에 클릭이 먹히지 않아서 애먹었습니다. 알고보니 처음에 내가 만든 SVG 이미지가 웹 페이지 배경을 높은 Z-index 값으로 덮고 있었습니다. 이것을 알아내는데 꽤나 오래 걸렸지만 이로인해 문제해결하는 시야를 넓히는데 도움이 되었습니다."
        ],
        "thingsToFix": "기술을 배우고 더 나은 포트폴리오 업데이트 하기!! (계획 : Reactnative, Graphql, AWS, Gsap 자세히, Threejs 자세히 등).",
        "description":"이 사이트가 당신이 현재 와있는 사이트 입니다.",
        "url":"#",
        "githubUrl":"https://github.com/johnpark144/Portfolio_Website--React"
    }
]
